In [1]:
import pandas as pd

In [34]:
d1=pd.DataFrame({
    "name": ['jaya','krishna'],
    "age": [30,40]
})

In [35]:
d1

      name  age
0     jaya   30
1  krishna   40

In [36]:
d2=pd.DataFrame({
    "name": ['jaya','krishna','yadav'],
    "marks": [90,100,80]
})

In [37]:
d2

      name  marks
0     jaya     90
1  krishna    100
2    yadav     80

In [39]:
pd.merge(d2,d1,on='name', how='left')

      name  marks   age
0     jaya     90  30.0
1  krishna    100  40.0
2    yadav     80   NaN

In [44]:
for i,row in d2.iterrows():
    print(f"{row['name']}")

jaya
krishna
yadav